sim/task_2D_Cylinder_Template_medium2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "1500";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14132
(
(4.9999 0.00451553 0)
(4.99943 0.0136514 0)
(4.9984 0.0234057 0)
(4.99693 0.0342759 0)
(4.99529 0.0467807 0)
(4.99384 0.061553 0)
(4.99315 0.0792571 0)
(4.99434 0.100952 0)
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }
    topBot
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
