sim/task_2D_Cylinder_Template_medium2/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14132
(
5.84071e-06
5.84213e-06
5.84356e-06
5.84499e-06
5.84642e-06
5.84785e-06
5.84926e-06
5.8507e-06
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 5.84e-06;
    }
    topBot
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
236
(
0.000309069
0.000302905
0.000296452
0.000289711
0.000282683
0.000275367
0.000267765
0.000259888
...
)
;
    }
}


// ************************************************************************* //
