sim/task_2D_Cylinder_Template_medium2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14132
(
1.0446e-09
1.04562e-09
1.04664e-09
1.04767e-09
1.04869e-09
1.04972e-09
1.05073e-09
1.05177e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
190
(
1.04412e-09
1.04418e-09
1.04424e-09
1.0443e-09
1.04435e-09
1.0444e-09
1.04443e-09
1.04445e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
91
(
1.10738e-09
1.09454e-09
1.09209e-09
1.09316e-09
1.08924e-09
1.08661e-09
1.08259e-09
1.07873e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
236
(
0.000309069
0.000302905
0.000296452
0.000289711
0.000282683
0.000275367
0.000267765
0.000259888
...
)
;
    }
}


// ************************************************************************* //
