sim/task_2D_Cylinder_Template_medium2/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1500";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
27960
(
4.68722
0.00466645
-0.00438417
4.68646
0.0139875
-0.013225
4.68526
0.0238901
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
91
(
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
190
(
-0.00010314
0.000385184
0.00102356
0.00179237
0.0026893
0.00365986
0.00467129
0.005698
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
91
(
4.78587
4.77455
4.76956
4.75935
4.75292
4.7444
4.73827
4.73138
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
