sim/task_2D_Cylinder_Template_medium2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            empty;
        physicalType    empty;
        nFaces          28264;
        startFace       27960;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          91;
        startFace       56224;
    }
    topBot
    {
        type            patch;
        physicalType    patch;
        nFaces          190;
        startFace       56315;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          91;
        startFace       56505;
    }
    wall
    {
        type            wall;
        physicalType    wall;
        nFaces          236;
        startFace       56596;
    }
)

// ************************************************************************* //
